cobra203/console_stm32/user/inc/cc85xx_ehif.h
#ifndef _CC85XX_EHIF_H_
#define _CC85XX_EHIF_H_

#ifdef __cplusplus
 extern "C" {
#endif

#include <stm32f0xx.h>
#include <vocal_common.h>

/* EHIF Status Word Define */
typedef struct ehif_status_word_s
{
    uint16_t    evt_sr_chg          :1;
    uint16_t    evt_nwk_chg         :1;
    uint16_t    evt_ps_chg          :1;
    uint16_t    evt_vol_chg         :1;
    uint16_t    evt_spi_error       :1;
    uint16_t    evt_dsc_reset       :1;
    uint16_t    evt_dsc_tx_avail    :1;
    uint16_t    evt_dsc_rx_avail    :1;
    uint16_t    wasp_conn           :1;
    uint16_t    pwr_state           :3;
    uint16_t                        :3;
    uint16_t    cmdreq_rdy          :1;
} EHIF_STATUS_S;

typedef struct ehif_device_info_s
{
    uint32_t    device_id;
    uint32_t    manf_id;
    uint32_t    prod_id;
} EHIF_DEV_INFO_S;

typedef struct ehif_set_volume_s
{
    uint8_t     is_local    :1;
    uint8_t     is_in_vol   :1;
    uint8_t                 :6;
    uint8_t     log_channel :4;
    uint8_t     set_op      :2;
    uint8_t     mute_op     :2;
    uint16_t    volume      :16;
} EHIF_SET_VOLUME_S;

typedef struct ehif_get_volume_s
{
    uint8_t     is_local    :1;
    uint8_t     is_in_vol   :1;
    uint8_t                 :6;
} EHIF_GET_VOLUME_S;

typedef struct ehif_nwm_get_status_s
{
    uint8_t     byte0_to_4[5];
    uint8_t     dev_data[16 * MAX_DEV_NUM];
} EHIF_NWM_GET_STATUS_S;

typedef struct cc85xx_ehif_s
{
    VOCAL_DEV_TYPE_E    dev_type;
    EHIF_STATUS_S       status;
    
    void    (*init)                 (struct cc85xx_ehif_s *, VOCAL_DEV_TYPE_E);
    void    (*get_status)           (struct cc85xx_ehif_s *);
    void    (*di_get_device_info)   (struct cc85xx_ehif_s *, EHIF_DEV_INFO_S *);
    void    (*ehc_evt_clr)          (struct cc85xx_ehif_s *, uint8_t);
    void    (*nwm_control_enable)   (struct cc85xx_ehif_s *, uint8_t);
    void    (*nwm_control_signal)   (struct cc85xx_ehif_s *, uint8_t);
    void    (*nwm_get_status)       (struct cc85xx_ehif_s *, EHIF_NWM_GET_STATUS_S *);
    void    (*vc_set_volume)        (struct cc85xx_ehif_s *, EHIF_SET_VOLUME_S *);
    void    (*vc_get_volume)        (struct cc85xx_ehif_s *, EHIF_GET_VOLUME_S *, uint16_t *);
    void    (*rc_get_data)          (struct cc85xx_ehif_s *, uint8_t, uint8_t *, uint8_t *);
} CC85XX_EHIF_S;

void ehif_init(CC85XX_EHIF_S *ehif, VOCAL_DEV_TYPE_E dev_type);

#ifdef __cplusplus
}
#endif

#endif /* _CC85XX_EHIF_H_ */